jnsbyr/esp8266-intexsbh20/SBH20IO.cpp
/*
 * project:  Intex PureSpa SB-H20 WiFi Controller
 *
 * file:     SBH20IO.cpp
 *
 * encoding: UTF-8
 * created:  14th March 2021
 *
 * Copyright (C) 2021 Jens B.
 *
 *
 * Receive data handling based on code from:
 *
 * DIYSCIP <https://github.com/yorffoeg/diyscip> (c) by Geoffroy HUBERT - yorffoeg@gmail.com
 *
 * DIYSCIP is licensed under a
 * Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.
 *
 * You should have received a copy of the license along with this
 * work. If not, see <https://creativecommons.org/licenses/by-nc-sa/4.0/>.
 *
 * DIYSCIP is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY.
 *
 * SPDX-License-Identifier: CC-BY-NC-SA-4.0
 *
 */

#include "SBH20IO.h"

#include <ESP8266WiFi.h>


// bit mask for LEDs
namespace FRAME_LED
{
  const uint16 POWER          = 0x0001;
  const uint16 HEATER_ON      = 0x0080;  // max. 72 h, will start filter, will not stop filter
  const uint16 NO_BEEP        = 0x0100;
  const uint16 HEATER_STANDBY = 0x0200;
  const uint16 BUBBLE         = 0x0400;  // max. 30 min
  const uint16 FILTER         = 0x1000;  // max. 24 h
}

namespace FRAME_DIGIT
{
  // bit mask of 7-segment display selector
  const uint16 POS_1 = 0x0040;
  const uint16 POS_2 = 0x0020;
  const uint16 POS_3 = 0x0800;
  const uint16 POS_4 = 0x0004;

  // bit mask of 7-segment display element
  const uint16 SEGMENT_A  = 0x2000;
  const uint16 SEGMENT_B  = 0x1000;
  const uint16 SEGMENT_C  = 0x0200;
  const uint16 SEGMENT_D  = 0x0400;
  const uint16 SEGMENT_E  = 0x0080;
  const uint16 SEGMENT_F  = 0x0008;
  const uint16 SEGMENT_G  = 0x0010;
  const uint16 SEGMENT_DP = 0x8000;
  const uint16 SEGMENTS   = SEGMENT_A | SEGMENT_B | SEGMENT_C | SEGMENT_D | SEGMENT_E | SEGMENT_F | SEGMENT_G;

  // bit mask of human readable value on 7-segment display
  const uint16 OFF   = 0x0000;
  const uint16 NUM_0 = SEGMENT_A | SEGMENT_B | SEGMENT_C | SEGMENT_D | SEGMENT_E | SEGMENT_F;
  const uint16 NUM_1 = SEGMENT_B | SEGMENT_C;
  const uint16 NUM_2 = SEGMENT_A | SEGMENT_B | SEGMENT_G | SEGMENT_E | SEGMENT_D;
  const uint16 NUM_3 = SEGMENT_A | SEGMENT_B | SEGMENT_C | SEGMENT_D | SEGMENT_G;
  const uint16 NUM_4 = SEGMENT_F | SEGMENT_G | SEGMENT_B | SEGMENT_C;
  const uint16 NUM_5 = SEGMENT_A | SEGMENT_F | SEGMENT_G | SEGMENT_C | SEGMENT_D;
  const uint16 NUM_6 = SEGMENT_A | SEGMENT_F | SEGMENT_E | SEGMENT_D | SEGMENT_C | SEGMENT_G;
  const uint16 NUM_7 = SEGMENT_A | SEGMENT_B | SEGMENT_C;
  const uint16 NUM_8 = SEGMENT_A | SEGMENT_B | SEGMENT_C | SEGMENT_D | SEGMENT_E | SEGMENT_F | SEGMENT_G;
  const uint16 NUM_9 = SEGMENT_A | SEGMENT_B | SEGMENT_C | SEGMENT_D | SEGMENT_F | SEGMENT_G;
  const uint16 LET_A = SEGMENT_E | SEGMENT_F | SEGMENT_A | SEGMENT_B | SEGMENT_C | SEGMENT_G;
  const uint16 LET_C = SEGMENT_A | SEGMENT_F | SEGMENT_E | SEGMENT_D;
  const uint16 LET_D = SEGMENT_B | SEGMENT_C | SEGMENT_D | SEGMENT_E | SEGMENT_G;
  const uint16 LET_E = SEGMENT_A | SEGMENT_F | SEGMENT_E | SEGMENT_D | SEGMENT_G;
  const uint16 LET_F = SEGMENT_E | SEGMENT_F | SEGMENT_A | SEGMENT_G;
  const uint16 LET_H = SEGMENT_B | SEGMENT_C | SEGMENT_E | SEGMENT_F | SEGMENT_G;
  const uint16 LET_N = SEGMENT_A | SEGMENT_B | SEGMENT_C | SEGMENT_E | SEGMENT_F;
}

// bit mask of button
namespace FRAME_BUTTON
{
  const uint16 POWER     = 0x0400;
  const uint16 FILTER    = 0x0002;
  const uint16 HEATER    = 0x8000;
  const uint16 BUBBLE    = 0x0008;
  const uint16 TEMP_UP   = 0x1000;
  const uint16 TEMP_DOWN = 0x0080;
  const uint16 TEMP_UNIT = 0x2000;
}

// frame type markers
namespace FRAME_TYPE
{
  const uint16 CUE    = 0x0100;
  const uint16 LED    = 0x4000;
  const uint16 DIGIT  = FRAME_DIGIT::POS_1 | FRAME_DIGIT::POS_2 | FRAME_DIGIT::POS_3 | FRAME_DIGIT::POS_4;
  const uint16 BUTTON = CUE | FRAME_BUTTON::POWER | FRAME_BUTTON::FILTER | FRAME_BUTTON::HEATER | FRAME_BUTTON::BUBBLE | FRAME_BUTTON::TEMP_UP | FRAME_BUTTON::TEMP_DOWN | FRAME_BUTTON::TEMP_UNIT;
}

namespace DIGIT
{
  // 7-segment display update control
  const uint8 POS_1     = 0x8;
  const uint8 POS_2     = 0x4;
  const uint8 POS_3     = 0x2;
  const uint8 POS_4     = 0x1;
  const uint8 POS_1_2   = POS_1 | POS_2;
  const uint8 POS_1_2_3 = POS_1 | POS_2 | POS_3;
  const uint8 POS_ALL   = POS_1 | POS_2 | POS_3 | POS_4;

  // nibble value used to map a subset of non-numeric states of the 7-segment display
  const uint8 LET_C = 0xC;
  const uint8 LET_D = 0xD;
  const uint8 LET_E = 0xE;
  const uint8 LET_F = 0xF;

  const uint8 LET_N = 0xA;
  const uint8 OFF   = 0xB;
};

namespace ERROR
{
  // internal binary value of error display (3 letters)
  const uint16 NONE             = 0;
  const uint16 NO_WATER_FLOW    = (DIGIT::LET_E << 8) | (9 << 4) | 0;
  const uint16 WATER_TEMP_LOW   = (DIGIT::LET_E << 8) | (9 << 4) | 4;
  const uint16 WATER_TEMP_HIGH  = (DIGIT::LET_E << 8) | (9 << 4) | 5;
  const uint16 SYSTEM           = (DIGIT::LET_E << 8) | (9 << 4) | 6;
  const uint16 DRY_FIRE_PROTECT = (DIGIT::LET_E << 8) | (9 << 4) | 7;
  const uint16 TEMP_SENSOR      = (DIGIT::LET_E << 8) | (9 << 4) | 9;
  const uint16 HEATING_ABORTED  = (DIGIT::LET_E << 8) | (DIGIT::LET_N << 4) | DIGIT::LET_D;

  const uint16 VALUES[] = { NO_WATER_FLOW, WATER_TEMP_LOW, WATER_TEMP_HIGH, WATER_TEMP_HIGH, SYSTEM, DRY_FIRE_PROTECT, TEMP_SENSOR, HEATING_ABORTED };
  const unsigned int COUNT = sizeof(VALUES)/sizeof(uint16);

  // human readable error on display
  const char CODE_90[]    PROGMEM = "E90";
  const char CODE_94[]    PROGMEM = "E94";
  const char CODE_95[]    PROGMEM = "E95";
  const char CODE_96[]    PROGMEM = "E96";
  const char CODE_97[]    PROGMEM = "E97";
  const char CODE_99[]    PROGMEM = "E99";
  const char CODE_END[]   PROGMEM = "END";
  const char CODE_OTHER[] PROGMEM = "EXX";

  // English error messages
  const char EN_90[]    PROGMEM = "no water flow";
  const char EN_94[]    PROGMEM = "water temp too low";
  const char EN_95[]    PROGMEM = "water temp too high";
  const char EN_96[]    PROGMEM = "system error";
  const char EN_97[]    PROGMEM = "dry fire protection";
  const char EN_99[]    PROGMEM = "water temp sensor error";
  const char EN_END[]   PROGMEM = "heating aborted after 72h";
  const char EN_OTHER[] PROGMEM = "error";

  // German error messages
  const char DE_90[]    PROGMEM = "kein Wasserdurchfluss";
  const char DE_94[]    PROGMEM = "Wassertemperatur zu niedrig";
  const char DE_95[]    PROGMEM = "Wassertemperatur zu hoch";
  const char DE_96[]    PROGMEM = "Systemfehler";
  const char DE_97[]    PROGMEM = "Trocken-Brandschutz";
  const char DE_99[]    PROGMEM = "Wassertemperatursensor defekt";
  const char DE_END[]   PROGMEM = "Heizbetrieb nach 72 h deaktiviert";
  const char DE_OTHER[] PROGMEM = "Störung";

  const char* const TEXT[3][COUNT+1] PROGMEM = {
                                                 { CODE_90, CODE_94, CODE_95, CODE_96, CODE_97, CODE_99, CODE_END, CODE_OTHER },
                                                 { EN_90,   EN_94,   EN_95,   EN_96,   EN_97,   EN_99,   EN_END,   EN_OTHER },
                                                 { DE_90,   DE_94,   DE_95,   DE_96,   DE_97,   DE_99,   DE_END,   DE_OTHER }
                                               };
}

// special display values
inline uint8 display2Byte(uint16 v)    { return v & 0x000F; }
inline uint16 display2Num(uint16 v)   { return (((v >> 12) & 0x000F)*100) + (((v >> 8) & 0x000F)*10) + ((v >> 4) & 0x000F); }
inline uint16 display2Error(uint16 v) { return (v >> 4) & 0x0FFF; }
inline bool displayIsTemp(uint16 v)   { return display2Byte(v) == DIGIT::LET_C || display2Byte(v) == DIGIT::LET_F; }
inline bool displayIsError(uint16 v)  { return (v & 0xF000) == 0xE000; }
inline bool displayIsBlank(uint16 v)  { return (v & 0xFFF0) == ((DIGIT::OFF << 12) + (DIGIT::OFF << 8) + (DIGIT::OFF <<4)); }

volatile SBH20IO::State SBH20IO::state;
volatile SBH20IO::IsrState SBH20IO::isrState;
volatile SBH20IO::Buttons SBH20IO::buttons;


// @TODO detect when latch signal stays low
// @TODO detect act temp change during error
// @TODO improve reliability of water temp change (counter auto repeat and too short press)
void SBH20IO::setup(LANG language)
{
  this->language = language;

  pinMode(PIN::CLOCK, INPUT);
  pinMode(PIN::DATA,  INPUT);
  pinMode(PIN::LATCH, INPUT);

